// Тримата магьосници и магическите отвари

// Трима магьосници, A, B и C, всеки има отвара. Една от тези отвари е мощен еликсир на безсмъртието, докато другите две са безвредни. Всеки магьосник прави две твърдения за отварите:

// Магьосник A:
// Еликсирът не е при Магьосник B.
// Еликсирът е при Магьосник C.

// Магьосник Б:
// Еликсирът не е при Магьосник A.
// Еликсирът е при Магьосник C.

// Магьосник C:
// Еликсирът не е при мен.
// Еликсирът е при Магьосник A.

// Магьосниците също разкриват, че:

// Един магьосник казва истината и в двете твърдения.
// Един магьосник лъже и в двете твърдения.
// Един магьосник има едно вярно твърдение и едно невярно твърдение.
// Задача:
// Определете кой магьосник притежава еликсира на безсмъртието.
