// Тримата магьосници и магическите отвари

// Трима магьосници, A, B и C, всеки има отвара. Една от тези отвари е мощен еликсир на безсмъртието, докато другите две са безвредни. Всеки магьосник прави две твърдения за отварите:

// Съветник A:
// Еликсирът не е с Wizard B.
// Еликсирът е с Wizard C.
// Съветник Б:
// Еликсирът не е с Wizard A.
// Еликсирът е с Wizard C.
// Съветник C:
// Еликсирът не е при мен.
// Еликсирът е с Wizard A.
// Магьосниците също разкриват, че:

// Един магьосник казва истината и в двете твърдения.
// Един магьосник лъже и в двете твърдения.
// Един магьосник има едно вярно твърдение и едно невярно твърдение.
// Задача:
// Определете кой магьосник притежава еликсира на безсмъртието.
